Revit 2024 API
FunctionId.File Property
The name of the file including the function throwing an exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string File { get; }
Visual Basic
Public ReadOnly Property File As String
	Get
Visual C++
public:
property String^ File {
	String^ get ();
}
See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace